{
  "personalInfo": {
    "name": "Sreeram Sutraye",
    "title": "Python Full Stack Developer",
    "summary": "Full Stack Developer with 4.5+ years of experience at Gramener, Gloroots, and NPCI, specializing in building robust, scalable web applications. Proven ability to optimize performance, resolve complex problems, and deliver high-quality, maintainable code. Experienced in product ownership, bug resolution, and feature implementation to meet business goals."
  },
  "skills": {
    "programming": ["Python", "JavaScript"],
    "frameworks": ["Django", "FastAPI", "ReactJS", "jQuery"],
    "databases": ["PostgreSQL", "MongoDB", "Clickhouse"],
    "devops": ["Docker", "Kubernetes", "AWS", "Jenkins"],
    "tools": ["Git Version Control", "GitHub Copilot", "ChatGPT"],
    "concepts": ["System Design", "Prompt Engineering"]
  },
  "workExperience": [
    {
      "position": "Senior Data Science Engineer",
      "company": "Gramener",
      "duration": "08/2024 - Present",
      "responsibilities": [
        "Led backend development for a major data science project detecting semiconductor chip defects for Applied Materials.",
        "Refactored legacy Python code, reducing data processing time and server usage, boosting performance and scalability.",
        "Designed and implemented backend for 2 Generative AI POCs, enabling advanced AI integration.",
        "Conducted 100+ L1 technical interviews for Python backend roles, aiding recruitment."
      ]
    },
    {
      "position": "Software Development Engineer",
      "company": "Gloroots (Zemploy India Private Limited)",
      "duration": "08/2023 - 08/2024",
      "responsibilities": [
        "Built a web app to manage hundreds of employers, employees, contractors, and partners.",
        "Optimized database queries, reducing server response time by 30%.",
        "Integrated Amplitude and Hotjar for user behavior analysis and drop-off detection.",
        "Redesigned database schema for 30% faster data retrieval and better data management."
      ]
    },
    {
      "position": "Associate AI Product",
      "company": "National Payments Corporation of India (NPCI)",
      "duration": "08/2021 - 08/2023",
      "responsibilities": [
        "Developed an AI-powered Online Response Management app, cutting response time to 20 seconds and reducing manual work by 90%.",
        "Built a WhatsApp Bot for RuPay offers, increasing offer redemptions by 50%.",
        "Led architecture and ownership of three full-stack apps using diverse tech stacks.",
        "Deployed products with Docker and Kubernetes, launching two months early."
      ]
    }
  ],
  "internships": [
    {
      "position": "Developer Intern",
      "company": "Viniculum Solutions",
      "duration": "01/2021 - 07/2021",
      "responsibilities": [
        "Conducted research and development for finding complementary technologies and tools.",
        "Resolved over 50 bugs and implemented 20 new features in existing company software."
      ]
    }
  ],
  "achievements": [
    "Achieved recognition for orchestrating the successful delivery of ORM Automation in NPCI for optimizing workflows and reducing manual intervention by 90%, significantly enhancing operational efficiency.",
    "Solved more than 100 coding challenges in LeetCode platform.",
    "Received 5 stars in Problem-Solving of Hacker Rank."
  ],
  "education": [
    {
      "degree": "B.Tech (hons) in Computer Science",
      "institution": "Lovely Professional University, Punjab",
      "duration": "08/2017 - 05/2021"
    },
    {
      "degree": "XII (BIEAP)",
      "institution": "Sri Chaitanya Junior College, Vijayawada",
      "duration": "06/2015 - 05/2017"
    }
  ],
  "contact": {
    "github": "https://github.com/sreeramsutraye",
    "linkedin": "https://www.linkedin.com/in/sreeramsutraye/",
    "phone": "9652568259",
    "email": "sreeramsutraye@gmail.com",
    "location": "Bengaluru, India"
  }
}